Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: قل أروني الذين ألحقتم به شركاء كلا بل هو الله العزيز الحكيم
en: Say: Show me those whom ye have joined unto Him as partners. Nay (ye dare not)! For He is Allah, the Mighty, the Wise.

source: وما أرسلناك إلا كافة للناس بشيرا ونذيرا ولكن أكثر الناس لا يعلمون
en: And We have not sent thee (O Muhammad) save as a bringer of good tidings and a warner unto all mankind; but most of mankind know not.

source: قل لكم ميعاد يوم لا تستأخرون عنه ساعة ولا تستقدمون
en: Say (O Muhammad): Yours is the promise of a Day which ye cannot postpone nor hasten by an hour.

source: وقال الذين كفروا لن نؤمن بهذا القرآن ولا بالذي بين يديه ولو ترى إذ الظالمون موقوفون عند ربهم يرجع بعضهم إلى بعض القول يقول الذين استضعفوا للذين استكبروا لولا أنتم لكنا مؤمنين
en: And those who disbelieve say: We believe not in this Qur'an nor in that which was before it; but oh, if thou couldst see, when the wrong-doers are brought up before their Lord, how they cast the blame one to another; how those who were despised (in the earth) say unto those who were proud: But for you, we should have been believers.

source: قال الذين استكبروا للذين استضعفوا أنحن صددناكم عن الهدى بعد إذ جاءكم بل كنتم مجرمين
en: Those who were proud say unto those who were despised: Did we drive you away from the guidance after it had come unto you? Nay, but ye were guilty.

source: وقال الذين استضعفوا للذين استكبروا بل مكر الليل والنهار إذ تأمروننا أن نكفر بالله ونجعل له أندادا وأسروا الندامة لما رأوا العذاب وجعلنا الأغلال في أعناق الذين كفروا هل يجزون إلا ما كانوا يعملون
en: Those who were despised say unto those who were proud: Nay but (it was your) scheming night and day, when ye commanded us to disbelieve in Allah and set up rivals unto Him. And they are filled with remorse when they behold the doom; and We place carcans on the necks of those who disbelieved. Are they requited aught save what they used to do?

source: وما أرسلنا في قرية من نذير إلا قال مترفوها إنا بما أرسلتم به كافرون
en: And We sent not unto any township a warner, but its pampered ones declared: Lo! we are disbelievers in that wherewith ye have been sent.

source: وقالوا نحن أكثر أموالا وأولادا وما نحن بمعذبين
en: And they say: We are more (than you) in wealth and children. We are not the punished!

source: قل إن ربي يبسط الرزق لمن يشاء ويقدر ولكن أكثر الناس لا يعلمون
en: Say (O Muhammad): Lo! my Lord enlargeth the provision for whom He will and narroweth it (for whom He will). But most of mankind know not.

source: وما أموالكم ولا أولادكم بالتي تقربكم عندنا زلفى إلا من آمن وعمل صالحا فأولئك لهم جزاء الضعف بما عملوا وهم في الغرفات آمنون
en: And it is not your wealth nor your children that will bring you near unto Us, but he who believeth and doeth good (he draweth near). As for such, theirs will be twofold reward for what they did and they will dwell secure in lofty halls.

source: والذين يسعون في آياتنا معاجزين أولئك في العذاب محضرون
en: And as for those who strive against Our revelations, challenging, they will be brought to the doom.

source: قل إن ربي يبسط الرزق لمن يشاء من عباده ويقدر له وما أنفقتم من شيء فهو يخلفه وهو خير الرازقين
en: Say: Lo! my Lord enlargeth the provision for whom He will of His bondmen, and narroweth (it) for him. And whatsoever ye spend (for good) He replaceth it. And He is the Best of Providers.

source: ويوم يحشرهم جميعا ثم يقول للملائكة أهؤلاء إياكم كانوا يعبدون
en: And on the day when He will gather them all together, He will say unto the angels: Did these worship you?

source: قالوا سبحانك أنت ولينا من دونهم بل كانوا يعبدون الجن أكثرهم بهم مؤمنون
en: They will say: Be Thou Glorified. Thou (alone) art our Guardian, not them! Nay, but they worshipped the jinn; most of them were believers in them.

source: فاليوم لا يملك بعضكم لبعض نفعا ولا ضرا ونقول للذين ظلموا ذوقوا عذاب النار التي كنتم بها تكذبون
en: That day ye will possess no use nor hurt one for another. And We shall say unto those who did wrong: Taste the doom of the Fire which ye used to deny.

source: وإذا تتلى عليهم آياتنا بينات قالوا ما هذا إلا رجل يريد أن يصدكم عما كان يعبد آباؤكم وقالوا ما هذا إلا إفك مفترى وقال الذين كفروا للحق لما جاءهم إن هذا إلا سحر مبين
en: And if Our revelations are recited unto them in plain terms, they say: This is naught else than a man who would turn you away from what your fathers used to worship; and they say: This is naught else than an invented lie. Those who disbelieve say of the truth when it reacheth them: This is naught else than mere magic.

source: وما آتيناهم من كتب يدرسونها وما أرسلنا إليهم قبلك من نذير
en: And We have given them no scriptures which they study, nor sent We unto them, before thee, any warner.

source: وكذب الذين من قبلهم وما بلغوا معشار ما آتيناهم فكذبوا رسلي فكيف كان نكير
en: Those before them denied, and these have not attained a tithe of that which We bestowed on them (of old); yet they denied My messengers. How intense then was My abhorrence (of them)!

source: قل إنما أعظكم بواحدة أن تقوموا لله مثنى وفرادى ثم تتفكروا ما بصاحبكم من جنة إن هو إلا نذير لكم بين يدي عذاب شديد
en: Say (unto them, O Muhammad): I exhort you unto one thing only: that ye awake, for Allah's sake, by twos and singly, and then reflect: There is no madness in your comrade. He is naught else than a warner unto you in face of a terrific doom.

source: قل ما سألتكم من أجر فهو لكم إن أجري إلا على الله وهو على كل شيء شهيد
en: Say: Whatever reward I might have asked of you is yours. My reward is the affair of Allah only. He is Witness over all things.

source: قل إن ربي يقذف بالحق علام الغيوب
en: Say: Lo! my Lord hurleth the truth. (He is) the Knower of Things Hidden.

source: قل جاء الحق وما يبدئ الباطل وما يعيد
en: Say: The Truth hath come, and falsehood showeth not its face and will not return.

source: قل إن ضللت فإنما أضل على نفسي وإن اهتديت فبما يوحي إلي ربي إنه سميع قريب
en: Say: If I err, I err only to my own loss, and if I am rightly guided it is because of that which my Lord hath revealed unto me. Lo! He is Hearer, Nigh.

source: ولو ترى إذ فزعوا فلا فوت وأخذوا من مكان قريب
en: Couldst thou but see when they are terrified with no escape, and are seized from near at hand,

source: وقالوا آمنا به وأنى لهم التناوش من مكان بعيد
en: And say: We (now) believe therein. But how can they reach (faith) from afar off,

source: وقد كفروا به من قبل ويقذفون بالغيب من مكان بعيد
en: When they disbelieved in it of yore. They aim at the unseen from afar off.

source: وحيل بينهم وبين ما يشتهون كما فعل بأشياعهم من قبل إنهم كانوا في شك مريب
en: And a gulf is set between them and that which they desire, as was done for people of their kind of old. Lo! they were in hopeless doubt.

source: الحمد لله فاطر السماوات والأرض جاعل الملائكة رسلا أولي أجنحة مثنى وثلاث ورباع يزيد في الخلق ما يشاء إن الله على كل شيء قدير
en: Praise be to Allah, the Creator of the heavens and the earth, Who appointeth the angels messengers having wings two, three and four. He multiplieth in creation what He will. Lo! Allah is Able to do all things.

source: ما يفتح الله للناس من رحمة فلا ممسك لها وما يمسك فلا مرسل له من بعده وهو العزيز الحكيم
en: That which Allah openeth unto mankind of mercy none can withhold it; and that which He withholdeth none can release thereafter. He is the Mighty, the Wise.

source: يا أيها الناس اذكروا نعمت الله عليكم هل من خالق غير الله يرزقكم من السماء والأرض لا إله إلا هو فأنى تؤفكون
en: O mankind! Remember Allah's grace toward you! Is there any creator other than Allah who provideth for you from the sky and the earth? There is no Allah save Him. Whither then are ye turned?

source: وإن يكذبوك فقد كذبت رسل من قبلك وإلى الله ترجع الأمور
en: And if they deny thee, (O Muhammad), messengers (of Allah) were denied before thee. Unto Allah all things are brought back.

source: يا أيها الناس إن وعد الله حق فلا تغرنكم الحياة الدنيا ولا يغرنكم بالله الغرور
en: O mankind! Lo! the promise of Allah is true. So let not the life of the world beguile you, and let not the (avowed) beguiler beguile you with regard to Allah.

source: إن الشيطان لكم عدو فاتخذوه عدوا إنما يدعو حزبه ليكونوا من أصحاب السعير
en: Lo! the devil is an enemy for you, so treat him as an enemy. He only summoneth his faction to be owners of the flaming Fire.

source: الذين كفروا لهم عذاب شديد والذين آمنوا وعملوا الصالحات لهم مغفرة وأجر كبير
en: Those who disbelieve, theirs will be an awful doom; and those who believe and do good works, theirs will be forgiveness and a great reward.

source: أفمن زين له سوء عمله فرآه حسنا فإن الله يضل من يشاء ويهدي من يشاء فلا تذهب نفسك عليهم حسرات إن الله عليم بما يصنعون
en: Is he, the evil of whose deeds is made fairseeming unto him so that he deemeth it good, (other than Satan's dupe)? Allah verily sendeth whom He will astray, and guideth whom He will; so let not thy soul expire in sighings for them. Lo! Allah is Aware of what they do!

source: والله الذي أرسل الرياح فتثير سحابا فسقناه إلى بلد ميت فأحيينا به الأرض بعد موتها كذلك النشور
en: And Allah it is Who sendeth the winds and they raise a cloud; then We lead it unto a dead land and revive therewith the earth after its death. Such is the Resurrection.

source: من كان يريد العزة فلله العزة جميعا إليه يصعد الكلم الطيب والعمل الصالح يرفعه والذين يمكرون السيئات لهم عذاب شديد ومكر أولئك هو يبور
en: Whoso desireth power (should know that) all power belongeth to Allah. Unto Him good words ascend, and the pious deed doth He exalt; but those who plot iniquities, theirs will be an awful doom; and the plotting of such (folk) will come to naught.

source: والله خلقكم من تراب ثم من نطفة ثم جعلكم أزواجا وما تحمل من أنثى ولا تضع إلا بعلمه وما يعمر من معمر ولا ينقص من عمره إلا في كتاب إن ذلك على الله يسير
en: Allah created you from dust, then from a little fluid, then He made you pairs (the male and female). No female beareth or bringeth forth save with His knowledge. And no-one groweth old who groweth old, nor is aught lessened of his life, but it is recorded in a Book, Lo! that is easy for Allah.

source: وما يستوي البحران هذا عذب فرات سائغ شرابه وهذا ملح أجاج ومن كل تأكلون لحما طريا وتستخرجون حلية تلبسونها وترى الفلك فيه مواخر لتبتغوا من فضله ولعلكم تشكرون
en: And the two seas are not alike: this, fresh, sweet, good to drink, this (other) bitter, salt. And from them both ye eat fresh meat and derive the ornament that ye wear. And thou seest the ship cleaving them with its prow that ye may seek of His bounty, and that haply ye may give thanks.

source: يولج الليل في النهار ويولج النهار في الليل وسخر الشمس والقمر كل يجري لأجل مسمى ذلكم الله ربكم له الملك والذين تدعون من دونه ما يملكون من قطمير
en: He maketh the night to pass into the day and He maketh the day to pass into the night. He hath subdued the sun and moon to service. Each runneth unto an appointed term. Such is Allah, your Lord; His is the Sovereignty; and those unto whom ye pray instead of Him own not so much as the white spot on a date-stone.

source: إن تدعوهم لا يسمعوا دعاءكم ولو سمعوا ما استجابوا لكم ويوم القيامة يكفرون بشرككم ولا ينبئك مثل خبير
en: If ye pray unto them they hear not your prayer, and if they heard they could not grant it you. On the Day of Resurrection they will disown association with you. None can inform you like Him Who is Aware.

source: يا أيها الناس أنتم الفقراء إلى الله والله هو الغني الحميد
en: O mankind! Ye are the poor in your relation to Allah. And Allah! He is the Absolute, the Owner of Praise.

source: إن يشأ يذهبكم ويأت بخلق جديد
en: If He will, He can be rid of you and bring (instead of you) some new creation.

source: ولا تزر وازرة وزر أخرى وإن تدع مثقلة إلى حملها لا يحمل منه شيء ولو كان ذا قربى إنما تنذر الذين يخشون ربهم بالغيب وأقاموا الصلاة ومن تزكى فإنما يتزكى لنفسه وإلى الله المصير
en: And no burdened soul can bear another's burden, and if one heavy laden crieth for (help with) his load, naught of it will be lifted even though he (unto whom he crieth) be of kin. Thou warnest only those who fear their Lord in secret, and have established worship. He who groweth (in goodness), groweth only for himself, (he cannot by his merit redeem others). Unto Allah is the journeying.

source: وما يستوي الأعمى والبصير
en: The blind man is not equal with the seer;

source: ولا الظلمات ولا النور
en: Nor is darkness (tantamount to) light;

source: ولا الظل ولا الحرور
en: Nor is the shadow equal with the sun's full heat;

source: وما يستوي الأحياء ولا الأموات إن الله يسمع من يشاء وما أنت بمسمع من في القبور
en: Nor are the living equal with the dead. Lo! Allah maketh whom He will to hear. Thou canst not reach those who are in the graves.

source: إن أنت إلا نذير
en: Thou art but a warner.

source: إنا أرسلناك بالحق بشيرا ونذيرا وإن من أمة إلا خلا فيها نذير
en: Lo! We have sent thee with the Truth, a bearer of glad tidings and a warner; and there is not a nation but a warner hath passed among them.

source: وإن يكذبوك فقد كذب الذين من قبلهم جاءتهم رسلهم بالبينات وبالزبر وبالكتاب المنير
en: And if they deny thee, those before them also denied. Their messengers came unto them with clear proofs (of Allah's Sovereignty), and with the Psalms and the Scripture giving light.

source: ثم أخذت الذين كفروا فكيف كان نكير
en: Then seized I those who disbelieved, and how intense was My abhorrence!

source: ألم تر أن الله أنزل من السماء ماء فأخرجنا به ثمرات مختلفا ألوانها ومن الجبال جدد بيض وحمر مختلف ألوانها وغرابيب سود
en: Hast thou not seen that Allah causeth water to fall from the sky, and We produce therewith fruit of divers hues; and among the hills are streaks white and red, of divers hues, and (others) raven-black;

source: ومن الناس والدواب والأنعام مختلف ألوانه كذلك إنما يخشى الله من عباده العلماء إن الله عزيز غفور
en: And of men and beasts and cattle, in like manner, divers hues? The erudite among His bondmen fear Allah alone. Lo! Allah is Mighty, Forgiving.

source: إن الذين يتلون كتاب الله وأقاموا الصلاة وأنفقوا مما رزقناهم سرا وعلانية يرجون تجارة لن تبور
en: Lo! those who read the Scripture of Allah, and establish worship, and spend of that which We have bestowed on them secretly and openly, they look forward to imperishable gain,

source: ليوفيهم أجورهم ويزيدهم من فضله إنه غفور شكور
en: That He will pay them their wages and increase them of His grace. Lo! He is Forgiving, Responsive.

source: والذي أوحينا إليك من الكتاب هو الحق مصدقا لما بين يديه إن الله بعباده لخبير بصير
en: As for that which We inspire in thee of the Scripture, it is the Truth confirming that which was (revealed) before it. Lo! Allah is indeed Observer, Seer of His slaves.

source: ثم أورثنا الكتاب الذين اصطفينا من عبادنا فمنهم ظالم لنفسه ومنهم مقتصد ومنهم سابق بالخيرات بإذن الله ذلك هو الفضل الكبير
en: Then We gave the Scripture as inheritance unto those whom We elected of Our bondmen. But of them are some who wrong themselves and of them are some who are lukewarm, and of them are some who outstrip (others) through good deeds, by Allah's leave. That is the great favour!

source: جنات عدن يدخلونها يحلون فيها من أساور من ذهب ولؤلؤا ولباسهم فيها حرير
en: Gardens of Eden! They enter them wearing armlets of gold and pearl and their raiment therein is silk.

source: وقالوا الحمد لله الذي أذهب عنا الحزن إن ربنا لغفور شكور
en: And they say: Praise be to Allah Who hath put grief away from us. Lo! Our Lord is Forgiving, Bountiful,

source: الذي أحلنا دار المقامة من فضله لا يمسنا فيها نصب ولا يمسنا فيها لغوب
en: Who, of His grace, hath installed us in the mansion of eternity, where toil toucheth us not nor can weariness affect us.

source: والذين كفروا لهم نار جهنم لا يقضى عليهم فيموتوا ولا يخفف عنهم من عذابها كذلك نجزي كل كفور
en: But as for those who disbelieve, for them is fire of hell; it taketh not complete effect upon them so that they can die, nor is its torment lightened for them. Thus We punish every ingrate.

source: وهم يصطرخون فيها ربنا أخرجنا نعمل صالحا غير الذي كنا نعمل أولم نعمركم ما يتذكر فيه من تذكر وجاءكم النذير فذوقوا فما للظالمين من نصير
en: And they cry for help there, (saying): Our Lord! Release us; we will do right, not (the wrong) that we used to do. Did not We grant you a life long enough for him who reflected to reflect therein? And the warner came unto you. Now taste (the flavour of your deeds), for evil-doers have no helper.

source: إن الله عالم غيب السماوات والأرض إنه عليم بذات الصدور
en: Lo! Allah is the Knower of the Unseen of the heavens and the earth. Lo! He is Aware of the secret of (men's) breasts.

source: هو الذي جعلكم خلائف في الأرض فمن كفر فعليه كفره ولا يزيد الكافرين كفرهم عند ربهم إلا مقتا ولا يزيد الكافرين كفرهم إلا خسارا
en: He it is Who hath made you regents in the earth; so he who disbelieveth, his disbelief be on his own head. Their disbelief increaseth for the disbelievers, in their Lord's sight, naught save abhorrence. Their disbelief increaseth for the disbelievers naught save loss.

source: قل أرأيتم شركاءكم الذين تدعون من دون الله أروني ماذا خلقوا من الأرض أم لهم شرك في السماوات أم آتيناهم كتابا فهم على بينت منه بل إن يعد الظالمون بعضهم بعضا إلا غرورا
en: Say: Have ye seen your partner-gods to whom ye pray beside Allah? Show me what they created of the earth! Or have they any portion in the heavens? Or have We given them a scripture so they act on clear proof therefrom? Nay, the evil-doers promise one another only to deceive.

source: إن الله يمسك السماوات والأرض أن تزولا ولئن زالتا إن أمسكهما من أحد من بعده إنه كان حليما غفورا
en: Lo! Allah graspeth the heavens and the earth that they deviate not, and if they were to deviate there is not one that could grasp them after Him. Lo! He is ever Clement, Forgiving.

source: وأقسموا بالله جهد أيمانهم لئن جاءهم نذير ليكونن أهدى من إحدى الأمم فلما جاءهم نذير ما زادهم إلا نفورا
en: And they swore by Allah, their most binding oath, that if a warner came unto them they would be more tractable than any of the nations; yet, when a warner came unto them it aroused in them naught save repugnance,

source: استكبارا في الأرض ومكر السيئ ولا يحيق المكر السيئ إلا بأهله فهل ينظرون إلا سنت الأولين فلن تجد لسنت الله تبديلا ولن تجد لسنت الله تحويلا
en: (Shown in their) behaving arrogantly in the land and plotting evil; and the evil plot encloseth but the men who make it. Then, can they expect aught save the treatment of the folk of old? Thou wilt not find for Allah's way of treatment any substitute, nor wilt thou find for Allah's way of treatment aught of power to change.

source: أولم يسيروا في الأرض فينظروا كيف كان عاقبة الذين من قبلهم وكانوا أشد منهم قوة وما كان الله ليعجزه من شيء في السماوات ولا في الأرض إنه كان عليما قديرا
en: Have they not travelled in the land and seen the nature of the consequence for those who were before them, and they were mightier than these in power? Allah is not such that aught in the heavens or in the earth escapeth Him. Lo! He is the Wise, the Mighty.

source: ولو يؤاخذ الله الناس بما كسبوا ما ترك على ظهرها من دابة ولكن يؤخرهم إلى أجل مسمى فإذا جاء أجلهم فإن الله كان بعباده بصيرا
en: If Allah took mankind to task by that which they deserve, He would not leave a living creature on the surface of the earth; but He reprieveth them unto an appointed term, and when their term cometh - then verily (they will know that) Allah is ever Seer of His slaves.

source: يس
en: Ya Sin.

source: والقرآن الحكيم
en: By the wise Qur'an,

source: إنك لمن المرسلين
en: Lo! thou art of those sent

source: على صراط مستقيم
en: On a straight path,

source: تنزيل العزيز الرحيم
en: A revelation of the Mighty, the Merciful,

source: لتنذر قوما ما أنذر آباؤهم فهم غافلون
en: That thou mayst warn a folk whose fathers were not warned, so they are heedless.

source: لقد حق القول على أكثرهم فهم لا يؤمنون
en: Already hath the judgment, (for their infidelity) proved true of most of them, for they believe not.

source: إنا جعلنا في أعناقهم أغلالا فهي إلى الأذقان فهم مقمحون
en: Lo! We have put on their necks carcans reaching unto the chins, so that they are made stiff-necked.

source: وجعلنا من بين أيديهم سدا ومن خلفهم سدا فأغشيناهم فهم لا يبصرون
en: And We have set a bar before them and a bar behind them, and (thus) have covered them so that they see not.

source: وسواء عليهم أأنذرتهم أم لم تنذرهم لا يؤمنون
en: Whether thou warn them or thou warn them not, it is alike for them, for they believe not.

source: إنما تنذر من اتبع الذكر وخشي الرحمن بالغيب فبشره بمغفرة وأجر كريم
en: Thou warnest only him who followeth the Reminder and feareth the Beneficent in secret. To him bear tidings of forgiveness and a rich reward.

source: إنا نحن نحيي الموتى ونكتب ما قدموا وآثارهم وكل شيء أحصيناه في إمام مبين
en: Lo! We it is Who bring the dead to life. We record that which they send before (them, and their footprints. And all things We have kept in a clear Register.

source: واضرب لهم مثلا أصحاب القرية إذ جاءها المرسلون
en: Coin for them a similitude: The people of the city when those sent (from Allah) came unto them;

source: إذ أرسلنا إليهم اثنين فكذبوهما فعززنا بثالث فقالوا إنا إليكم مرسلون
en: When We sent unto them twain, and they denied them both, so We reinforced them with a third, and they said: Lo! we have been sent unto you.

source: قالوا ما أنتم إلا بشر مثلنا وما أنزل الرحمن من شيء إن أنتم إلا تكذبون
en: They said: Ye are but mortals like unto us. The Beneficent hath naught revealed. Ye do but lie!

source: قالوا ربنا يعلم إنا إليكم لمرسلون
en: They answered: Our Lord knoweth that we are indeed sent unto you,

source: وما علينا إلا البلاغ المبين
en: And our duty is but plain conveyance (of the message).

source: قالوا إنا تطيرنا بكم لئن لم تنتهوا لنرجمنكم وليمسنكم منا عذاب أليم
en: (The people of the city) said: We augur ill of you. If ye desist not, we shall surely stone you, and grievous torture will befall you at our hands.

source: قالوا طائركم معكم أئن ذكرتم بل أنتم قوم مسرفون
en: They said: Your evil augury be with you! Is it because ye are reminded (of the truth)? Nay, but ye are froward folk!

source: وجاء من أقصى المدينة رجل يسعى قال يا قوم اتبعوا المرسلين
en: And there came from the uttermost part of the city a man running. He cried: O my people! Follow those who have been sent!

source: اتبعوا من لا يسألكم أجرا وهم مهتدون
en: Follow those who ask of you no fee, and who are rightly guided.

source: وما لي لا أعبد الذي فطرني وإليه ترجعون
en: For what cause should I not serve Him Who hath created me, and unto Whom ye will be brought back?

source: أأتخذ من دونه آلهة إن يردن الرحمن بضر لا تغن عني شفاعتهم شيئا ولا ينقذون
en: Shall I take (other) gods in place of Him when, if the Beneficent should wish me any harm, their intercession will avail me naught, nor can they save?

source: إني إذا لفي ضلال مبين
en: Then truly I should be in error manifest.

source: إني آمنت بربكم فاسمعون
en: Lo! I have believed in your Lord, so hear me!

source: قيل ادخل الجنة قال يا ليت قومي يعلمون
en: It was said (unto him): Enter paradise. He said: Would that my people knew

source: بما غفر لي ربي وجعلني من المكرمين
en: With what (munificence) my Lord hath pardoned me and made me of the honoured ones!

source: وما أنزلنا على قومه من بعده من جند من السماء وما كنا منزلين
en: We sent not down against his people after him a host from heaven, nor do We ever send.

source: إن كانت إلا صيحة واحدة فإذا هم خامدون
en: It was but one Shout, and lo! they were extinct.

source: يا حسرة على العباد ما يأتيهم من رسول إلا كانوا به يستهزئون
en: Ah, the anguish for the bondmen! Never came there unto them a messenger but they did mock him!

source: ألم يروا كم أهلكنا قبلهم من القرون أنهم إليهم لا يرجعون
en: Have they not seen how many generations We destroyed before them, which indeed returned not unto them;

source: وإن كل لما جميع لدينا محضرون
en: But all, without exception, will be brought before Us.

source: وآية لهم الأرض الميتة أحييناها وأخرجنا منها حبا فمنه يأكلون
en: A token unto them is the dead earth. We revive it, and We bring forth from it grain so that they eat thereof;
